In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2013-01-01 -0.638176  0.047445  0.235716 -0.127261
2013-01-02  0.435312 -0.996469  0.503622 -1.654649
2013-01-03 -0.731868  1.861004  0.044890  1.377977
2013-01-04  0.169538  0.074329 -0.607168  0.769257
2013-01-05  0.433473 -3.426180  0.461530 -0.998435
2013-01-06  0.884389 -0.272040 -0.209351  0.646874

In [9]:
df2 = pd.DataFrame({'A': 1.,
                       'B': pd.Timestamp('20130102'),
                       'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                       'D': np.array([3] * 4, dtype='int32'),
                       'E': pd.Categorical(["test", "train", "test", "train"]),
                       'F': 'foo'})

In [10]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df2. # Type <TAB> to see a list of attributes.

In [13]:
df.head()

                   A         B         C         D
2013-01-01 -0.638176  0.047445  0.235716 -0.127261
2013-01-02  0.435312 -0.996469  0.503622 -1.654649
2013-01-03 -0.731868  1.861004  0.044890  1.377977
2013-01-04  0.169538  0.074329 -0.607168  0.769257
2013-01-05  0.433473 -3.426180  0.461530 -0.998435

In [14]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.169538  0.074329 -0.607168  0.769257
2013-01-05  0.433473 -3.426180  0.461530 -0.998435
2013-01-06  0.884389 -0.272040 -0.209351  0.646874

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.092111 -0.451985  0.071540  0.002294
std    0.645023  1.734995  0.425675  1.154116
min   -0.731868 -3.426180 -0.607168 -1.654649
25%   -0.436247 -0.815362 -0.145791 -0.780641
50%    0.301506 -0.112297  0.140303  0.259806
75%    0.434852  0.067608  0.405076  0.738661
max    0.884389  1.861004  0.503622  1.377977

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.638176    0.435312   -0.731868    0.169538    0.433473    0.884389
B    0.047445   -0.996469    1.861004    0.074329   -3.426180   -0.272040
C    0.235716    0.503622    0.044890   -0.607168    0.461530   -0.209351
D   -0.127261   -1.654649    1.377977    0.769257   -0.998435    0.646874

In [19]:
df

                   A         B         C         D
2013-01-01 -0.638176  0.047445  0.235716 -0.127261
2013-01-02  0.435312 -0.996469  0.503622 -1.654649
2013-01-03 -0.731868  1.861004  0.044890  1.377977
2013-01-04  0.169538  0.074329 -0.607168  0.769257
2013-01-05  0.433473 -3.426180  0.461530 -0.998435
2013-01-06  0.884389 -0.272040 -0.209351  0.646874

In [20]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.127261  0.235716  0.047445 -0.638176
2013-01-02 -1.654649  0.503622 -0.996469  0.435312
2013-01-03  1.377977  0.044890  1.861004 -0.731868
2013-01-04  0.769257 -0.607168  0.074329  0.169538
2013-01-05 -0.998435  0.461530 -3.426180  0.433473
2013-01-06  0.646874 -0.209351 -0.272040  0.884389

In [21]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05  0.433473 -3.426180  0.461530 -0.998435
2013-01-02  0.435312 -0.996469  0.503622 -1.654649
2013-01-06  0.884389 -0.272040 -0.209351  0.646874
2013-01-01 -0.638176  0.047445  0.235716 -0.127261
2013-01-04  0.169538  0.074329 -0.607168  0.769257
2013-01-03 -0.731868  1.861004  0.044890  1.377977

In [22]:
dates = pd.date_range('20130101', periods=6)

In [23]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [24]:
df

                   A         B         C         D
2013-01-01  0.355657  0.026571  0.049221 -0.026571
2013-01-02 -0.160790 -0.199935  0.329907 -0.927747
2013-01-03  1.341693  0.241372  0.841252 -2.270254
2013-01-04  0.255825 -1.058512  0.067533  0.220778
2013-01-05  1.838532  0.454701  0.646370 -0.769059
2013-01-06 -0.416033  0.739614 -2.306596 -0.403196

In [25]:
df2 = pd.DataFrame({'A': 1.,
                        'B': pd.Timestamp('20130102'),
                        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                        'D': np.array([3] * 4, dtype='int32'),
                        'E': pd.Categorical(["test", "train", "test", "train"]),
                        'F': 'foo'})

In [26]:
df['A']

2013-01-01    0.355657
2013-01-02   -0.160790
2013-01-03    1.341693
2013-01-04    0.255825
2013-01-05    1.838532
2013-01-06   -0.416033
Freq: D, Name: A, dtype: float64

In [27]:
df.A

2013-01-01    0.355657
2013-01-02   -0.160790
2013-01-03    1.341693
2013-01-04    0.255825
2013-01-05    1.838532
2013-01-06   -0.416033
Freq: D, Name: A, dtype: float64

In [28]:
df[0:3]

                   A         B         C         D
2013-01-01  0.355657  0.026571  0.049221 -0.026571
2013-01-02 -0.160790 -0.199935  0.329907 -0.927747
2013-01-03  1.341693  0.241372  0.841252 -2.270254

In [29]:
df.loc["2013-01-01"]

A    0.355657
B    0.026571
C    0.049221
D   -0.026571
Name: 2013-01-01 00:00:00, dtype: float64

In [30]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.160790 -0.199935
2013-01-03  1.341693  0.241372
2013-01-04  0.255825 -1.058512

In [31]:
df.loc['20130102', ['A', 'B']]

A   -0.160790
B   -0.199935
Name: 2013-01-02 00:00:00, dtype: float64

In [32]:
df.loc[dates[0], 'A']

0.3556574114258836

In [33]:
df.iloc[3]

A    0.255825
B   -1.058512
C    0.067533
D    0.220778
Name: 2013-01-04 00:00:00, dtype: float64

In [34]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.255825 -1.058512
2013-01-05  1.838532  0.454701

In [35]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.160790 -0.199935  0.329907 -0.927747
2013-01-03  1.341693  0.241372  0.841252 -2.270254

In [36]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  0.355657  0.026571  0.049221 -0.026571
2013-01-03  1.341693  0.241372  0.841252 -2.270254
2013-01-04  0.255825 -1.058512  0.067533  0.220778
2013-01-05  1.838532  0.454701  0.646370 -0.769059

In [37]:
df2 = df.copy()

In [38]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [39]:
df2

                   A         B         C         D      E
2013-01-01  0.355657  0.026571  0.049221 -0.026571    one
2013-01-02 -0.160790 -0.199935  0.329907 -0.927747    one
2013-01-03  1.341693  0.241372  0.841252 -2.270254    two
2013-01-04  0.255825 -1.058512  0.067533  0.220778  three
2013-01-05  1.838532  0.454701  0.646370 -0.769059   four
2013-01-06 -0.416033  0.739614 -2.306596 -0.403196  three

In [40]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  1.341693  0.241372  0.841252 -2.270254   two
2013-01-05  1.838532  0.454701  0.646370 -0.769059  four

In [41]:
df

                   A         B         C         D
2013-01-01  0.355657  0.026571  0.049221 -0.026571
2013-01-02 -0.160790 -0.199935  0.329907 -0.927747
2013-01-03  1.341693  0.241372  0.841252 -2.270254
2013-01-04  0.255825 -1.058512  0.067533  0.220778
2013-01-05  1.838532  0.454701  0.646370 -0.769059
2013-01-06 -0.416033  0.739614 -2.306596 -0.403196

In [42]:
df.iloc[0, 1] = 2

In [43]:
df

                   A         B         C         D
2013-01-01  0.355657  2.000000  0.049221 -0.026571
2013-01-02 -0.160790 -0.199935  0.329907 -0.927747
2013-01-03  1.341693  0.241372  0.841252 -2.270254
2013-01-04  0.255825 -1.058512  0.067533  0.220778
2013-01-05  1.838532  0.454701  0.646370 -0.769059
2013-01-06 -0.416033  0.739614 -2.306596 -0.403196

In [44]:
df.loc[dates[0], 'A'] = 2

In [45]:
df

                   A         B         C         D
2013-01-01  2.000000  2.000000  0.049221 -0.026571
2013-01-02 -0.160790 -0.199935  0.329907 -0.927747
2013-01-03  1.341693  0.241372  0.841252 -2.270254
2013-01-04  0.255825 -1.058512  0.067533  0.220778
2013-01-05  1.838532  0.454701  0.646370 -0.769059
2013-01-06 -0.416033  0.739614 -2.306596 -0.403196

In [46]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [47]:
df

                   A         B         C  D
2013-01-01  2.000000  2.000000  0.049221  5
2013-01-02 -0.160790 -0.199935  0.329907  5
2013-01-03  1.341693  0.241372  0.841252  5
2013-01-04  0.255825 -1.058512  0.067533  5
2013-01-05  1.838532  0.454701  0.646370  5
2013-01-06 -0.416033  0.739614 -2.306596  5

In [48]:
len(df)

6

In [49]:
len(df.iloc[1:3, :])

2